//#include <stdio.h>
//#include <stdlib.h>
#include <iostream>
using namespace std;
int main(int argc, char* argv[])
{
	int x=0,y=1;
	string ret = "{\"LABP时间0\":\"1601-01-01\",\"LABP时间1\":\"1601-01-01\",\"LABP时间2\":\"1601-01-01\",\"LABP时间3\":\"1601-01-01\",\
				 \"LABP导管置管日期\":\"\",\"起搏器置管日期\":\"\",\"静脉导管置管日期\":\"\",\"气管名称\":\"2\",\"气管置管日期\":\"\",\
				 \"化验时间0\":\"1601-01-01\",\"尿管置管日期\":\"\",\"化验时间1\":\"1601-01-01\",\"化验时间2\":\"1601-01-01\",\
				 \"化验时间3\":\"1601-01-01\",\"起搏器时间0\":\"12:12\",\"起搏器时间1\":\"1601-01-01\",\"起搏器时间2\":\"1601-01-01\",\
				 \"起搏器时间3\":\"1601-01-01\",\"附加项3\":\"1122333\"}";
	

	system("pause");
	return 0;
}